# A short introduction to pandas

https://pandas.pydata.org/

Import pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Series
Series is a **one-dimensional labeled array** capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

Create a Series of random numbers. The passed index is a list of axis labels.

In [2]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a   -1.380539
b   -0.257151
c   -0.076356
d    0.428701
e   -0.288634
dtype: float64

### Series is ndarray
Series acts very similarly to a `ndarray`, and is a valid argument to most NumPy functions. However, things like slicing also slice the index. **Logical indexing** is supported

In [3]:
s[0]

-1.380538525682169

In [4]:
s[s>s.median()]

c   -0.076356
d    0.428701
dtype: float64

In [5]:
np.exp(s)

a    0.251443
b    0.773252
c    0.926486
d    1.535262
e    0.749287
dtype: float64

In [6]:
 s + s*2

a   -4.141616
b   -0.771453
c   -0.229069
d    1.286103
e   -0.865901
dtype: float64

In [7]:
s[[4, 3, 1]]

e   -0.288634
d    0.428701
b   -0.257151
dtype: float64

In [8]:
### Series is dict-like

In [9]:
s['a']

-1.380538525682169

In [10]:
s.a

-1.380538525682169

In [11]:
s['e'] = 12

In [12]:
'e' in s

True

In [13]:
s.b

-0.25715083575296555

### Vectorized operations and label alignment with Series
A key difference between Series and ndarray is that operations between Series **automatically align the data based on label**. Thus, you can write computations without giving consideration to whether the Series involved have the same labels.

In [14]:
s[1:] + s[:-1]

a         NaN
b   -0.514302
c   -0.152712
d    0.857402
e         NaN
dtype: float64

The result of an operation between unaligned Series will have the union of the indexes involved. If a label is not found in one Series or the other, the result will be marked as missing NaN. **Being able to write code without doing any explicit data alignment grants immense freedom and flexibility in interactive data analysis and research**. The integrated data alignment features of the pandas data structures set pandas apart from the majority of related tools for working with labeled data.

## DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

* Dict of 1D ndarrays, lists, dicts, or Series
* 2-D numpy.ndarray
* Structured or record ndarray
* A Series
* Another DataFrame

Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

In [15]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)

In [16]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [17]:
# access to index
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
df.columns

Index(['one', 'two'], dtype='object')

### Column selection, addition, deletion

In [19]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [20]:
df['three'] = df.one * df.two
df['flag'] = df.one > 2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [21]:
del df['two']

### More complex examples

In [22]:
# More complex example
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Viewing data

In [24]:
dates = pd.DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.215711  1.603353  0.336389 -0.928424
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968
2013-01-03  0.348929  0.146523  0.514986  0.829169
2013-01-04 -1.013487 -1.038071  0.581796 -0.804200
2013-01-05  0.276609 -1.483003 -1.387622  0.285249
2013-01-06  0.443770 -3.260359  1.565317 -0.430022

In [25]:
df.head()

                   A         B         C         D
2013-01-01 -0.215711  1.603353  0.336389 -0.928424
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968
2013-01-03  0.348929  0.146523  0.514986  0.829169
2013-01-04 -1.013487 -1.038071  0.581796 -0.804200
2013-01-05  0.276609 -1.483003 -1.387622  0.285249

In [26]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.013487 -1.038071  0.581796 -0.804200
2013-01-05  0.276609 -1.483003 -1.387622  0.285249
2013-01-06  0.443770 -3.260359  1.565317 -0.430022

In [27]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.077220 -0.803801 -0.010702 -0.198699
std    0.603572  1.627792  1.256803  0.670277
min   -1.013487 -3.260359 -1.675078 -0.928424
25%   -0.092631 -1.371770 -0.956619 -0.710655
50%    0.312769 -0.914660  0.425688 -0.286995
75%    0.420060 -0.087920  0.565093  0.177944
max    0.623209  1.603353  1.565317  0.829169

In [28]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.443770 -3.260359  1.565317 -0.430022
2013-01-05  0.276609 -1.483003 -1.387622  0.285249
2013-01-04 -1.013487 -1.038071  0.581796 -0.804200
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968
2013-01-03  0.348929  0.146523  0.514986  0.829169
2013-01-01 -0.215711  1.603353  0.336389 -0.928424

In [29]:
# columns
df.A

2013-01-01   -0.215711
2013-01-02    0.623209
2013-01-03    0.348929
2013-01-04   -1.013487
2013-01-05    0.276609
2013-01-06    0.443770
Freq: D, Name: A, dtype: float64

In [30]:
# rows
df[0:3]

                   A         B         C         D
2013-01-01 -0.215711  1.603353  0.336389 -0.928424
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968
2013-01-03  0.348929  0.146523  0.514986  0.829169

In [31]:
# boolean indexing
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.215711  1.603353  0.336389 -0.928424    one
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968    one
2013-01-03  0.348929  0.146523  0.514986  0.829169    two
2013-01-04 -1.013487 -1.038071  0.581796 -0.804200  three
2013-01-05  0.276609 -1.483003 -1.387622  0.285249   four
2013-01-06  0.443770 -3.260359  1.565317 -0.430022  three

In [32]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.348929  0.146523  0.514986  0.829169   two
2013-01-05  0.276609 -1.483003 -1.387622  0.285249  four

In [33]:
df2[df2.A>0]

                   A         B         C         D      E
2013-01-02  0.623209 -0.791248 -1.675078 -0.143968    one
2013-01-03  0.348929  0.146523  0.514986  0.829169    two
2013-01-05  0.276609 -1.483003 -1.387622  0.285249   four
2013-01-06  0.443770 -3.260359  1.565317 -0.430022  three

### Operations

In [34]:
df.mean()

A    0.077220
B   -0.803801
C   -0.010702
D   -0.198699
dtype: float64

In [35]:
df.mean(axis=1)

2013-01-01    0.198902
2013-01-02   -0.496771
2013-01-03    0.459902
2013-01-04   -0.568490
2013-01-05   -0.577192
2013-01-06   -0.420323
Freq: D, dtype: float64

In [36]:
# applying functions to data
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.215711  1.603353  0.336389 -0.928424
2013-01-02  0.407498  0.812104 -1.338688 -1.072392
2013-01-03  0.756427  0.958628 -0.823702 -0.243223
2013-01-04 -0.257060 -0.079443 -0.241906 -1.047423
2013-01-05  0.019550 -1.562446 -1.629528 -0.762174
2013-01-06  0.463320 -4.822805 -0.064211 -1.192196

### Grouping
By **group by** we are referring to a process involving one or more of the following steps
* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [37]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                   'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                   'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.153315  3.235647
1  bar    one  0.206581  0.457052
2  foo    two -0.730012 -0.071151
3  bar  three  0.654300 -0.765342
4  foo    two  1.318977  0.748945
5  bar    two  0.635848 -0.586669
6  foo    one -0.526224 -2.095435
7  foo  three  0.085483 -0.174296

In [38]:
df.A.unique()

array(['foo', 'bar'], dtype=object)

Grouping and then applying a function sum to the resulting groups.

In [39]:
df.groupby('A').sum()

            C         D
A
bar  1.496730 -0.894959
foo  0.301539  1.643710

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [40]:
df.groupby(['A','B']).mean()

                  C         D
A   B
bar one    0.206581  0.457052
    three  0.654300 -0.765342
    two    0.635848 -0.586669
foo one   -0.186454  0.570106
    three  0.085483 -0.174296
    two    0.294482  0.338897

### Pivot Tables
A pivot table is a table that summarizes data in another table, and is made by applying an operation such as sorting, averaging, or summing to data in the first table, typically including grouping of the data.

We can produce pivot tables very easily.

In [41]:
dfp = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
dfp

        A  B    C         D         E
0     one  A  foo  1.172934  2.216107
1     one  B  foo  1.470890 -1.133658
2     two  C  foo -0.427017  1.996335
3   three  A  bar  0.117406  0.653047
4     one  B  bar  1.596921  0.174009
5     one  C  bar  1.379280  0.793188
6     two  A  foo  0.998194 -2.166868
7   three  B  foo -0.325988 -0.310963
8     one  C  foo  1.115380 -0.207752
9     one  A  bar  0.316814 -0.586585
10    two  B  bar -1.937619 -1.262634
11  three  C  bar  0.956585  1.398899

In [42]:
pd.pivot_table(dfp, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.316814  1.172934
      B  1.596921  1.470890
      C  1.379280  1.115380
three A  0.117406       NaN
      B       NaN -0.325988
      C  0.956585       NaN
two   A       NaN  0.998194
      B -1.937619       NaN
      C       NaN -0.427017